app/controllers/navigs_controller.rb

SELECT  "navigs".* FROM "navigs" WHERE "navigs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_navig
      @navig = Navig.find(params[:id])